Строка:per(5)gog((23+2)*per)z ( 214748364)f ( 2147483647)b ( 1) c ( 2) d ( b + c * 2)z ( 81)c ( c + 1) c ( c + 1) c ( c + 1) c ( c + 1) c ( c + 1) c ( c + 1)            cc ( c + f / 65536 * (d * d + b))   abc ( cc / 100)f ( cc - 100 * abc)          z ( z)c ( c - c)
Лексемы: I(C)I((C+C)*I)I(C)I(C)I(C)I(C)I(I+I*C)I(C)I(I+C)I(I+C)I(I+C)I(I+C)I(I+C)I(I+C)I(I+I/C*(I*I+I))I(I/C)I(I-C*I)I(I)I(I-I)?
Стек: ? | Y: I | Сдвиг
Стек: ?I | Y: - | 
Стек: ?I | Y: ( | Сдвиг
Стек: ?I( | Y: - | 
Стек: ?I( | Y: C | Сдвиг
Стек: ?I(C | Y: - | 
Стек: ?I(M | Y: - | Свертка: C -> M
Стек: ?I(T | Y: - | Свертка: M -> T
Стек: ?I(E | Y: - | Свертка: T -> E
Стек: ?I(E | Y: ) | Сдвиг
Стек: ?I(E) | Y: - | 
Стек: ?S | Y: - | Свертка: I(E) -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: ( | Сдвиг
Стек: ?LI(( | Y: - | 
Стек: ?LI(( | Y: C | Сдвиг
Стек: ?LI((C | Y: - | 
Стек: ?LI((M | Y: - | Свертка: C -> M
Стек: ?LI((T | Y: - | Свертка: M -> T
Стек: ?LI((E | Y: - | Свертка: T -> E
Стек: ?LI((E | Y: + | Сдвиг
Стек: ?LI((E+ | Y: - | 
Стек: ?LI((E+ | Y: C | Сдвиг
Стек: ?LI((E+C | Y: - | 
Стек: ?LI((E+M | Y: - | Свертка: C -> M
Стек: ?LI((E+T | Y: - | Свертка: M -> T
Стек: ?LI((E | Y: - | Свертка: E+T -> E
Стек: ?LI((E | Y: ) | Сдвиг
Стек: ?LI((E) | Y: - | 
Стек: ?LI(M | Y: - | Свертка: (E) -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(T | Y: * | Сдвиг
Стек: ?LI(T* | Y: - | 
Стек: ?LI(T* | Y: I | Сдвиг
Стек: ?LI(T*I | Y: - | 
Стек: ?LI(T*M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: T*M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: C | Сдвиг
Стек: ?LI(C | Y: - | 
Стек: ?LI(M | Y: - | Свертка: C -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: C | Сдвиг
Стек: ?LI(C | Y: - | 
Стек: ?LI(M | Y: - | Свертка: C -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: C | Сдвиг
Стек: ?LI(C | Y: - | 
Стек: ?LI(M | Y: - | Свертка: C -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: C | Сдвиг
Стек: ?LI(C | Y: - | 
Стек: ?LI(M | Y: - | Свертка: C -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: I | Сдвиг
Стек: ?LI(E+I | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: I -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E+T | Y: * | Сдвиг
Стек: ?LI(E+T* | Y: - | 
Стек: ?LI(E+T* | Y: C | Сдвиг
Стек: ?LI(E+T*C | Y: - | 
Стек: ?LI(E+T*M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: T*M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: C | Сдвиг
Стек: ?LI(C | Y: - | 
Стек: ?LI(M | Y: - | Свертка: C -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: C | Сдвиг
Стек: ?LI(E+C | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: C | Сдвиг
Стек: ?LI(E+C | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: C | Сдвиг
Стек: ?LI(E+C | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: C | Сдвиг
Стек: ?LI(E+C | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: C | Сдвиг
Стек: ?LI(E+C | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: C | Сдвиг
Стек: ?LI(E+C | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: + | Сдвиг
Стек: ?LI(E+ | Y: - | 
Стек: ?LI(E+ | Y: I | Сдвиг
Стек: ?LI(E+I | Y: - | 
Стек: ?LI(E+M | Y: - | Свертка: I -> M
Стек: ?LI(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E+T | Y: / | Сдвиг
Стек: ?LI(E+T/ | Y: - | 
Стек: ?LI(E+T/ | Y: C | Сдвиг
Стек: ?LI(E+T/C | Y: - | 
Стек: ?LI(E+T/M | Y: - | Свертка: C -> M
Стек: ?LI(E+T | Y: - | Свертка: T/M -> T
Стек: ?LI(E+T | Y: * | Сдвиг
Стек: ?LI(E+T* | Y: - | 
Стек: ?LI(E+T* | Y: ( | Сдвиг
Стек: ?LI(E+T*( | Y: - | 
Стек: ?LI(E+T*( | Y: I | Сдвиг
Стек: ?LI(E+T*(I | Y: - | 
Стек: ?LI(E+T*(M | Y: - | Свертка: I -> M
Стек: ?LI(E+T*(T | Y: - | Свертка: M -> T
Стек: ?LI(E+T*(T | Y: * | Сдвиг
Стек: ?LI(E+T*(T* | Y: - | 
Стек: ?LI(E+T*(T* | Y: I | Сдвиг
Стек: ?LI(E+T*(T*I | Y: - | 
Стек: ?LI(E+T*(T*M | Y: - | Свертка: I -> M
Стек: ?LI(E+T*(T | Y: - | Свертка: T*M -> T
Стек: ?LI(E+T*(E | Y: - | Свертка: T -> E
Стек: ?LI(E+T*(E | Y: + | Сдвиг
Стек: ?LI(E+T*(E+ | Y: - | 
Стек: ?LI(E+T*(E+ | Y: I | Сдвиг
Стек: ?LI(E+T*(E+I | Y: - | 
Стек: ?LI(E+T*(E+M | Y: - | Свертка: I -> M
Стек: ?LI(E+T*(E+T | Y: - | Свертка: M -> T
Стек: ?LI(E+T*(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E+T*(E | Y: ) | Сдвиг
Стек: ?LI(E+T*(E) | Y: - | 
Стек: ?LI(E+T*M | Y: - | Свертка: (E) -> M
Стек: ?LI(E+T | Y: - | Свертка: T*M -> T
Стек: ?LI(E | Y: - | Свертка: E+T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(T | Y: / | Сдвиг
Стек: ?LI(T/ | Y: - | 
Стек: ?LI(T/ | Y: C | Сдвиг
Стек: ?LI(T/C | Y: - | 
Стек: ?LI(T/M | Y: - | Свертка: C -> M
Стек: ?LI(T | Y: - | Свертка: T/M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: - | Сдвиг
Стек: ?LI(E- | Y: - | 
Стек: ?LI(E- | Y: C | Сдвиг
Стек: ?LI(E-C | Y: - | 
Стек: ?LI(E-M | Y: - | Свертка: C -> M
Стек: ?LI(E-T | Y: - | Свертка: M -> T
Стек: ?LI(E-T | Y: * | Сдвиг
Стек: ?LI(E-T* | Y: - | 
Стек: ?LI(E-T* | Y: I | Сдвиг
Стек: ?LI(E-T*I | Y: - | 
Стек: ?LI(E-T*M | Y: - | Свертка: I -> M
Стек: ?LI(E-T | Y: - | Свертка: T*M -> T
Стек: ?LI(E | Y: - | Свертка: E-T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: I | Сдвиг
Стек: ?LI | Y: - | 
Стек: ?LI | Y: ( | Сдвиг
Стек: ?LI( | Y: - | 
Стек: ?LI( | Y: I | Сдвиг
Стек: ?LI(I | Y: - | 
Стек: ?LI(M | Y: - | Свертка: I -> M
Стек: ?LI(T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: T -> E
Стек: ?LI(E | Y: - | Сдвиг
Стек: ?LI(E- | Y: - | 
Стек: ?LI(E- | Y: I | Сдвиг
Стек: ?LI(E-I | Y: - | 
Стек: ?LI(E-M | Y: - | Свертка: I -> M
Стек: ?LI(E-T | Y: - | Свертка: M -> T
Стек: ?LI(E | Y: - | Свертка: E-T -> E
Стек: ?LI(E | Y: ) | Сдвиг
Стек: ?LI(E) | Y: - | 
Стек: ?LS | Y: - | Свертка: I(E) -> S
Стек: ?S | Y: - | Свертка: LS -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: ? | Цепочка принята!
