Строка 1: acvsad(544*(363+34)*111112+(vasd+82)-c)
Лексемы: I(C*(C+C)*C+(I+C)-I)?
Стек: ? | Y: I | Сдвиг
Стек: ?I | Y: - | 
Стек: ?I | Y: ( | Сдвиг
Стек: ?I( | Y: - | 
Стек: ?I( | Y: C | Сдвиг
Стек: ?I(C | Y: - | 
Стек: ?I(M | Y: - | Свертка: C -> M
Стек: ?I(T | Y: - | Свертка: M -> T
Стек: ?I(T | Y: * | Сдвиг
Стек: ?I(T* | Y: - | 
Стек: ?I(T* | Y: ( | Сдвиг
Стек: ?I(T*( | Y: - | 
Стек: ?I(T*( | Y: C | Сдвиг
Стек: ?I(T*(C | Y: - | 
Стек: ?I(T*(M | Y: - | Свертка: C -> M
Стек: ?I(T*(T | Y: - | Свертка: M -> T
Стек: ?I(T*(E | Y: - | Свертка: T -> E
Стек: ?I(T*(E | Y: + | Сдвиг
Стек: ?I(T*(E+ | Y: - | 
Стек: ?I(T*(E+ | Y: C | Сдвиг
Стек: ?I(T*(E+C | Y: - | 
Стек: ?I(T*(E+M | Y: - | Свертка: C -> M
Стек: ?I(T*(E+T | Y: - | Свертка: M -> T
Стек: ?I(T*(E | Y: - | Свертка: E+T -> E
Стек: ?I(T*(E | Y: ) | Сдвиг
Стек: ?I(T*(E) | Y: - | 
Стек: ?I(T*M | Y: - | Свертка: (E) -> M
Стек: ?I(T | Y: - | Свертка: T*M -> T
Стек: ?I(T | Y: * | Сдвиг
Стек: ?I(T* | Y: - | 
Стек: ?I(T* | Y: C | Сдвиг
Стек: ?I(T*C | Y: - | 
Стек: ?I(T*M | Y: - | Свертка: C -> M
Стек: ?I(T | Y: - | Свертка: T*M -> T
Стек: ?I(E | Y: - | Свертка: T -> E
Стек: ?I(E | Y: + | Сдвиг
Стек: ?I(E+ | Y: - | 
Стек: ?I(E+ | Y: ( | Сдвиг
Стек: ?I(E+( | Y: - | 
Стек: ?I(E+( | Y: I | Сдвиг
Стек: ?I(E+(I | Y: - | 
Стек: ?I(E+(M | Y: - | Свертка: I -> M
Стек: ?I(E+(T | Y: - | Свертка: M -> T
Стек: ?I(E+(E | Y: - | Свертка: T -> E
Стек: ?I(E+(E | Y: + | Сдвиг
Стек: ?I(E+(E+ | Y: - | 
Стек: ?I(E+(E+ | Y: C | Сдвиг
Стек: ?I(E+(E+C | Y: - | 
Стек: ?I(E+(E+M | Y: - | Свертка: C -> M
Стек: ?I(E+(E+T | Y: - | Свертка: M -> T
Стек: ?I(E+(E | Y: - | Свертка: E+T -> E
Стек: ?I(E+(E | Y: ) | Сдвиг
Стек: ?I(E+(E) | Y: - | 
Стек: ?I(E+M | Y: - | Свертка: (E) -> M
Стек: ?I(E+T | Y: - | Свертка: M -> T
Стек: ?I(E | Y: - | Свертка: E+T -> E
Стек: ?I(E | Y: - | Сдвиг
Стек: ?I(E- | Y: - | 
Стек: ?I(E- | Y: I | Сдвиг
Стек: ?I(E-I | Y: - | 
Стек: ?I(E-M | Y: - | Свертка: I -> M
Стек: ?I(E-T | Y: - | Свертка: M -> T
Стек: ?I(E | Y: - | Свертка: E-T -> E
Стек: ?I(E | Y: ) | Сдвиг
Стек: ?I(E) | Y: - | 
Стек: ?S | Y: - | Свертка: I(E) -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: ? | Цепочка принята!
---- Конец обработки строки 1 ----

Строка 2: b(2 + 4 * b)
Лексемы: I(C+C*I)?
Стек: ? | Y: I | Сдвиг
Стек: ?I | Y: - | 
Стек: ?I | Y: ( | Сдвиг
Стек: ?I( | Y: - | 
Стек: ?I( | Y: C | Сдвиг
Стек: ?I(C | Y: - | 
Стек: ?I(M | Y: - | Свертка: C -> M
Стек: ?I(T | Y: - | Свертка: M -> T
Стек: ?I(E | Y: - | Свертка: T -> E
Стек: ?I(E | Y: + | Сдвиг
Стек: ?I(E+ | Y: - | 
Стек: ?I(E+ | Y: C | Сдвиг
Стек: ?I(E+C | Y: - | 
Стек: ?I(E+M | Y: - | Свертка: C -> M
Стек: ?I(E+T | Y: - | Свертка: M -> T
Стек: ?I(E+T | Y: * | Сдвиг
Стек: ?I(E+T* | Y: - | 
Стек: ?I(E+T* | Y: I | Сдвиг
Стек: ?I(E+T*I | Y: - | 
Стек: ?I(E+T*M | Y: - | Свертка: I -> M
Стек: ?I(E+T | Y: - | Свертка: T*M -> T
Стек: ?I(E | Y: - | Свертка: E+T -> E
Стек: ?I(E | Y: ) | Сдвиг
Стек: ?I(E) | Y: - | 
Стек: ?S | Y: - | Свертка: I(E) -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: ? | Цепочка принята!
---- Конец обработки строки 2 ----

Строка 3: dsh(2 + 4 * (as*a+v))
Лексемы: I(C+C*(I*I+I))?
Стек: ? | Y: I | Сдвиг
Стек: ?I | Y: - | 
Стек: ?I | Y: ( | Сдвиг
Стек: ?I( | Y: - | 
Стек: ?I( | Y: C | Сдвиг
Стек: ?I(C | Y: - | 
Стек: ?I(M | Y: - | Свертка: C -> M
Стек: ?I(T | Y: - | Свертка: M -> T
Стек: ?I(E | Y: - | Свертка: T -> E
Стек: ?I(E | Y: + | Сдвиг
Стек: ?I(E+ | Y: - | 
Стек: ?I(E+ | Y: C | Сдвиг
Стек: ?I(E+C | Y: - | 
Стек: ?I(E+M | Y: - | Свертка: C -> M
Стек: ?I(E+T | Y: - | Свертка: M -> T
Стек: ?I(E+T | Y: * | Сдвиг
Стек: ?I(E+T* | Y: - | 
Стек: ?I(E+T* | Y: ( | Сдвиг
Стек: ?I(E+T*( | Y: - | 
Стек: ?I(E+T*( | Y: I | Сдвиг
Стек: ?I(E+T*(I | Y: - | 
Стек: ?I(E+T*(M | Y: - | Свертка: I -> M
Стек: ?I(E+T*(T | Y: - | Свертка: M -> T
Стек: ?I(E+T*(T | Y: * | Сдвиг
Стек: ?I(E+T*(T* | Y: - | 
Стек: ?I(E+T*(T* | Y: I | Сдвиг
Стек: ?I(E+T*(T*I | Y: - | 
Стек: ?I(E+T*(T*M | Y: - | Свертка: I -> M
Стек: ?I(E+T*(T | Y: - | Свертка: T*M -> T
Стек: ?I(E+T*(E | Y: - | Свертка: T -> E
Стек: ?I(E+T*(E | Y: + | Сдвиг
Стек: ?I(E+T*(E+ | Y: - | 
Стек: ?I(E+T*(E+ | Y: I | Сдвиг
Стек: ?I(E+T*(E+I | Y: - | 
Стек: ?I(E+T*(E+M | Y: - | Свертка: I -> M
Стек: ?I(E+T*(E+T | Y: - | Свертка: M -> T
Стек: ?I(E+T*(E | Y: - | Свертка: E+T -> E
Стек: ?I(E+T*(E | Y: ) | Сдвиг
Стек: ?I(E+T*(E) | Y: - | 
Стек: ?I(E+T*M | Y: - | Свертка: (E) -> M
Стек: ?I(E+T | Y: - | Свертка: T*M -> T
Стек: ?I(E | Y: - | Свертка: E+T -> E
Стек: ?I(E | Y: ) | Сдвиг
Стек: ?I(E) | Y: - | 
Стек: ?S | Y: - | Свертка: I(E) -> S
Стек: ?L | Y: - | Свертка: S -> L
Стек: ?L | Y: ? | Цепочка принята!
---- Конец обработки строки 3 ----

